<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt" %>
<%@ page isELIgnored="false" %>

<fmt:setLocale value="${sessionScope.lang}"/>
<fmt:setBundle basename="messages"/>

<html>
<head>
    <title>Welcome Page</title>
    <jsp:include page="/WEB-INF/include/head.jsp"/>
</head>

<body>

<jsp:include page="/WEB-INF/include/menu.jsp"/>

<div class="container-fluid">
    <div class="row">
        <div class="col-sm-3"></div>
        <div class="col-sm-6">
            <h3><fmt:message key="welcome.moto"/></h3>

            <p>Існують ролі: «Клієнт», «Адміністратор».</p>
            <p>Клієнт реєструється в системі та має можливість створювати замовлення в службі таксі, вказуючи адресу
                відправлення, адресу призначення, кількість пасажирів і категорію авто.</p>
            <p>Служба таксі має автопарк із водіями. </p>
            <p>Автомобіль має характеристики по місткості, категорії і може бути доступний: «до замовлення»,
                «знаходиться в рейсі» або бути неактивним (знаходиться в автопарку без водія).</p>
            <p>Система розраховує вартість поїздки залежно від відстані та призначає відповідне авто серед
                доступних. Якщо відповідних авто немає, клієнту може бути запропоновано скасувати замовлення або
                скористатися альтернативним рішенням:
            <ul>
                <li> авто з потрібною кількістю місць, але іншої категорії;</li>
                <li> декілька автомобілів обраної категорії для забезпечення необхідної місткості.</li>
            </ul>

            </p>
            <p>Система підтримує програму лояльності: розраховується знижка залежно від витраченої суми.</p>
            <p>Після підтвердження замовлення клієнтом, система повідомляє час очікування.</p>
            <p>Адміністратор системи може переглядати статистику замовлень, сортувати: </p>
            <ul>
                <li>за датою оформлення замовлення;</li>
                <li>за вартістю замовлення</li>

            </ul>
            <p> та фільтрувати замовлення: </p>
            <ul>
                <li> за клієнтами;</li>
                <li>за певними датами.</li>
            </ul>


        </div>
        <div class="col-sm-3"></div>
    </div>

</div>

</body>
</html>
